
#Область ОбработчикиСобытий

Функция ПроверитьДоступность(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Ok");
	Возврат Ответ;
КонецФункции

Функция ПолучитьЗаказНаряды(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ЗаказНаряд.Ссылка) КАК КоличествоДокументов
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("Количество", Выборка.КоличествоДокументов);
	
	ТелоОтвета = ЗаписатьЗначениеJSON(Результат);
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

