
#Область ОбработчикиСобытий

Функция ПроверитьДоступность(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Ok");
	Возврат Ответ;
КонецФункции

Функция ПолучитьЗаказНаряды(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ЗаказНаряд.Ссылка) КАК КоличествоДокументов
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("Количество", Выборка.КоличествоДокументов);
	
	ТелоОтвета = ЗаписатьЗначениеJSON(Результат);
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьТокен(Запрос)
	
	Результат = Новый Структура;
	Результат.Вставить("ПоддерживаетсяТокенДоступа", Ложь);
	Результат.Вставить("ТокенДоступа", "");
	
	УстановитьПривилегированныйРежим(Истина);
	Эмитент = Справочники.ЭмитентыJWT.ЭмитентМобильногоПриложения;
	Используется = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эмитент, "Используется");
	Если Используется Тогда
		Результат.ТокенДоступа = ТокеныДоступа.СформироватьТокенДоступа(Эмитент);
		Результат.ПоддерживаетсяТокенДоступа = Истина;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ТелоОтвета = ЗаписатьЗначениеJSON(Результат);
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

