///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСообщения = ПользователиСлужебный.ПараметрыСообщения();
	ПараметрыСообщения.ТипСообщения = "Ошибка";
	ПараметрыСообщения.Группа = Элементы.ГруппаПредупреждение;
	ПараметрыСообщения.Заголовок = НСтр("ru = 'Ваша учетная запись отключена'");
	ПараметрыСообщения.Сообщение =
		НСтр("ru = 'Дальнейшая работа невозможна и будет
		           |автоматически завершена через 5 минут.
		           |
		           |Обратитесь к администратору.'");
	ПользователиСлужебный.ВывестиСообщениеНаФорму(ЭтотОбъект, ПараметрыСообщения);
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	КоманднаяПанель.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Низ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияЗавершитьРаботу", 5 * 60, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ПрекратитьРаботуСистемы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОжиданияЗавершитьРаботу()
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
