
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Константы.АдресЦентральнойБазы.Получить();
	Логин = Константы.ЛогинЦентральнойБазы.Получить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьРаботу(Команда)
	
	СохранитьПараметрыПодключения();
	
	ПараметрыОбмена = ОбменКлиент.НовыеПараметрыОбмена();
	ПараметрыОбмена.Логин = Логин;
	ПараметрыОбмена.Пароль = Пароль;
	
	ОбменКлиент.ВыполнитьОбмен(ПараметрыОбмена);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьПараметрыПодключения()
	
	Константы.АдресЦентральнойБазы.Установить(Адрес);
	Константы.ЛогинЦентральнойБазы.Установить(Логин);

КонецПроцедуры

#КонецОбласти
