
Функция ВыполнитьОбмен(ПараметрыОбмена) Экспорт
	
	Адрес = Константы.АдресЦентральнойБазы.Получить();
	
	Если Не ЗначениеЗаполнено(Адрес) Тогда		
		Возврат ПодготовитьОписаниеОшибки(
			ОбменКлиентСервер.КодОшибки_АдресНеЗадан(), 
			"Не заполнен адрес");
	КонецЕсли;
	
	КонтекстОбмена = НовыйКонтекстОбмена();
	ЗаполнитьЗначенияСвойств(КонтекстОбмена, ПараметрыОбмена);
	КонтекстОбмена.Адрес = Адрес;
	
	// 1. Получить данные для аутентификации
	ВыполнитьАутентификацию(КонтекстОбмена);
	
	Если КонтекстОбмена.ОшибкаОбмена Тогда
		Возврат ПодготовитьОписаниеОшибки(
			КонтекстОбмена.КодОшибки, 
			КонтекстОбмена.КраткийТекстОшибки);
	КонецЕсли;
	
	Если Не КонтекстОбмена.АутентификацияВыполнена Тогда
		Возврат ПодготовитьОписаниеОшибки(
			ОбменКлиентСервер.КодОшибки_АутентификацияНеВыполнена(),
			КонтекстОбмена.КраткийТекстОшибки);
	КонецЕсли;
	
	// 2. Проверить доступность центральной базы
	ПроверитьДоступность(КонтекстОбмена);
	
	Если КонтекстОбмена.ОшибкаОбмена Тогда
		Возврат ПодготовитьОписаниеОшибки(
			КонтекстОбмена.КодОшибки, 
			КонтекстОбмена.КраткийТекстОшибки);
	КонецЕсли;
	
	Если Не КонтекстОбмена.АутентификацияВыполнена Тогда
		Возврат ПодготовитьОписаниеОшибки(
			ОбменКлиентСервер.КодОшибки_АутентификацияНеВыполнена(),
			КонтекстОбмена.КраткийТекстОшибки);
	КонецЕсли;
	
	// 3. Выполнить обмен
	ВыполнитьОбменСлужебный(КонтекстОбмена);
	
	Если КонтекстОбмена.ОшибкаОбмена Тогда
		Возврат ПодготовитьОписаниеОшибки(
			КонтекстОбмена.КодОшибки, 
			КонтекстОбмена.КраткийТекстОшибки);
	КонецЕсли;
	
	Если Не КонтекстОбмена.АутентификацияВыполнена Тогда
		Возврат ПодготовитьОписаниеОшибки(
			ОбменКлиентСервер.КодОшибки_АутентификацияНеВыполнена(),
			КонтекстОбмена.КраткийТекстОшибки);
	КонецЕсли;

	Результат = НовыйРезультатВыполненияОбмена();
	Результат.Результат = КонтекстОбмена.Результат;
	
	Возврат Результат;

КонецФункции

Процедура ВыполнитьАутентификацию(КонтекстОбмена)
	
	Токен = Константы.ТокенЦентральнойБазы.Получить();
	
	// TODO Если токен заполнен - проверить время жизни
	
	Если ЗначениеЗаполнено(Токен) Тогда
		КонтекстОбмена.Токен = Токен;
		КонтекстОбмена.АутентификацияВыполнена = Истина;
		Возврат;
	КонецЕсли;
	
	ОписаниеТокена = ПолучитьОписаниеТокена(КонтекстОбмена);
	
	Если КонтекстОбмена.ОшибкаОбмена Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписаниеТокена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстОбмена.АутентификацияВыполнена = Истина;
	
	Если ОписаниеТокена.ПоддерживаетсяТокенДоступа Тогда
		КонтекстОбмена.Токен = ОписаниеТокена.ТокенДоступа;
		Константы.ТокенЦентральнойБазы.Установить(ОписаниеТокена.ТокенДоступа);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДоступность(КонтекстОбмена)
	
	СтруктураURI = ОбщегоНазначенияСервер.СтруктураURI(КонтекстОбмена.Адрес);
	
	Если Не ЗначениеЗаполнено(КонтекстОбмена.Токен) Тогда
		СтруктураURI.Логин = КонтекстОбмена.Логин;
		СтруктураURI.Пароль = КонтекстОбмена.Пароль;
	КонецЕсли;
	
	ПутьЗапроса = СтруктураURI.ПутьНаСервере + "/hs/mob-repair/ping";
	Если Лев(ПутьЗапроса, 1) <> "/" Тогда
		ПутьЗапроса = "/" + ПутьЗапроса;
	КонецЕсли;
	
	Попытка
		
		Соединение = ОбщегоНазначенияСервер.СоединениеHTTP(СтруктураURI);
		
		// Создание HTTP запроса с учетом относительного пути
		ЗапросHTTP = Новый HTTPЗапрос(ПутьЗапроса);
		
		Если ЗначениеЗаполнено(КонтекстОбмена.Токен) Тогда
			ЗапросHTTP.Заголовки.Вставить("Authorization", "Bearer " + КонтекстОбмена.Токен);
		КонецЕсли;
		
		// Выполнение GET запроса
		ОтветHTTP = Соединение.Получить(ЗапросHTTP);
		
		// Проверка кода состояния
		Если ОтветHTTP.КодСостояния = 401 Тогда
			КонтекстОбмена.АутентификацияПройдена = Ложь;
		ИначеЕсли ОтветHTTP.КодСостояния <> 200 Тогда
			КонтекстОбмена.ОшибкаОбмена = Истина;
			ШаблонТекстаОшибки = 
				"Код состояния: %1
				|%2";
			КонтекстОбмена.ПодробныйТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, 
				ОтветHTTP.КодСостояния, 
				ОтветHTTP.ПолучитьТелоКакСтроку());
			КонтекстОбмена.КраткийТекстОшибки = КонтекстОбмена.ПодробныйТекстОшибки;
		КонецЕсли;
		
	Исключение
		КонтекстОбмена.ОшибкаОбмена = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонтекстОбмена.КодОшибки = ОбменКлиентСервер.КодОшибки_ОшибкаСоединения();
		КонтекстОбмена.ПодробныйТекстОшибки = 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонтекстОбмена.КраткийТекстОшибки = 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьОбменСлужебный(КонтекстОбмена)
	
	СтруктураURI = ОбщегоНазначенияСервер.СтруктураURI(КонтекстОбмена.Адрес);
	
	Если Не ЗначениеЗаполнено(КонтекстОбмена.Токен) Тогда
		СтруктураURI.Логин = КонтекстОбмена.Логин;
		СтруктураURI.Пароль = КонтекстОбмена.Пароль;
	КонецЕсли;
	
	ПутьЗапроса = СтруктураURI.ПутьНаСервере + "/hs/mob-repair/order-outfits";
	Если Лев(ПутьЗапроса, 1) <> "/" Тогда
		ПутьЗапроса = "/" + ПутьЗапроса;
	КонецЕсли;
	
	Попытка
		
		Соединение = ОбщегоНазначенияСервер.СоединениеHTTP(СтруктураURI);
		
		// Создание HTTP запроса с учетом относительного пути
		ЗапросHTTP = Новый HTTPЗапрос(ПутьЗапроса);
		
		Если ЗначениеЗаполнено(КонтекстОбмена.Токен) Тогда
			ЗапросHTTP.Заголовки.Вставить("Authorization", "Bearer " + КонтекстОбмена.Токен);
		КонецЕсли;
		
		// Выполнение GET запроса
		ОтветHTTP = Соединение.Получить(ЗапросHTTP);
		
		// Проверка кода состояния
		Если ОтветHTTP.КодСостояния = 200 Тогда
			Попытка
				РезультатJSON = ПрочитатьЗначениеJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
				КонтекстОбмена.Результат = РезультатJSON.Количество;
			Исключение
				КонтекстОбмена.ОшибкаОбмена = Истина;
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				КонтекстОбмена.КодОшибки = ОбменКлиентСервер.КодОшибки_ОшибкаРазбораОтвета();
				КонтекстОбмена.ПодробныйТекстОшибки = 
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				КонтекстОбмена.КраткийТекстОшибки = 
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			КонецПопытки;		
		ИначеЕсли ОтветHTTP.КодСостояния = 401 Тогда
			КонтекстОбмена.АутентификацияПройдена = Ложь;
		Иначе
			КонтекстОбмена.ОшибкаОбмена = Истина;
			ШаблонТекстаОшибки = 
				"Код состояния: %1
				|%2";
			КонтекстОбмена.ПодробныйТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, 
				ОтветHTTP.КодСостояния, 
				ОтветHTTP.ПолучитьТелоКакСтроку());
			КонтекстОбмена.КраткийТекстОшибки = КонтекстОбмена.ПодробныйТекстОшибки;
		КонецЕсли;

		
	Исключение
		КонтекстОбмена.ОшибкаОбмена = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонтекстОбмена.КодОшибки = ОбменКлиентСервер.КодОшибки_ОшибкаСоединения();
		КонтекстОбмена.ПодробныйТекстОшибки = 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонтекстОбмена.КраткийТекстОшибки = 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьОписаниеТокена(КонтекстОбмена)
	
	СтруктураURI = ОбщегоНазначенияСервер.СтруктураURI(КонтекстОбмена.Адрес);
	
	СтруктураURI.Логин = КонтекстОбмена.Логин;
	СтруктураURI.Пароль = КонтекстОбмена.Пароль;
	
	ПутьЗапроса = СтруктураURI.ПутьНаСервере + "/hs/mob-repair/token";
	Если Лев(ПутьЗапроса, 1) <> "/" Тогда
		ПутьЗапроса = "/" + ПутьЗапроса;
	КонецЕсли;
	
	Попытка
		
		Соединение = ОбщегоНазначенияСервер.СоединениеHTTP(СтруктураURI);
		
		ЗапросHTTP = Новый HTTPЗапрос(ПутьЗапроса);
		
		ОтветHTTP = Соединение.Получить(ЗапросHTTP);
		
		Если ОтветHTTP.КодСостояния = 200 Тогда
			Попытка
				Возврат ПрочитатьЗначениеJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
			Исключение
				КонтекстОбмена.ОшибкаОбмена = Истина;
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				КонтекстОбмена.КодОшибки = ОбменКлиентСервер.КодОшибки_ОшибкаРазбораОтвета();
				КонтекстОбмена.ПодробныйТекстОшибки = 
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				КонтекстОбмена.КраткийТекстОшибки = 
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			КонецПопытки;
		ИначеЕсли ОтветHTTP.КодСостояния = 401 Тогда
			КонтекстОбмена.АутентификацияПройдена = Ложь;
		Иначе
			КонтекстОбмена.ОшибкаОбмена = Истина;
			ШаблонТекстаОшибки = 
				"Код состояния: %1
				|%2";
			КонтекстОбмена.ПодробныйТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, 
				ОтветHTTP.КодСостояния, 
				ОтветHTTP.ПолучитьТелоКакСтроку());
			КонтекстОбмена.КраткийТекстОшибки = КонтекстОбмена.ПодробныйТекстОшибки;
		КонецЕсли;
		
	Исключение
		КонтекстОбмена.ОшибкаОбмена = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонтекстОбмена.КодОшибки = ОбменКлиентСервер.КодОшибки_ОшибкаСоединения();
		КонтекстОбмена.ПодробныйТекстОшибки = 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонтекстОбмена.КраткийТекстОшибки = 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат Неопределено;	
	
КонецФункции

Функция НовыйРезультатВыполненияОбмена()
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Истина);
	Результат.Вставить("КодОшибки");
	Результат.Вставить("ТекстОшибки");
	Результат.Вставить("Результат");
	
	Возврат Результат;
	
КонецФункции

Функция НовыйКонтекстОбмена()
	
	Результат = Новый Структура;
	Результат.Вставить("Адрес", "");
	Результат.Вставить("Логин", "");
	Результат.Вставить("Пароль", "");
	Результат.Вставить("Токен", "");
	Результат.Вставить("АутентификацияВыполнена", Ложь);
	Результат.Вставить("ОшибкаОбмена", Ложь);
	Результат.Вставить("КодОшибки");
	Результат.Вставить("КраткийТекстОшибки");
	Результат.Вставить("ПодробныйТекстОшибки");
	Результат.Вставить("Результат");
	
	Возврат Результат;	
	
КонецФункции

Функция ПодготовитьОписаниеОшибки(КодОшибки, ТекстОшибки)
	
	Результат = НовыйРезультатВыполненияОбмена();
	Результат.Успешно = Ложь;
	Результат.КодОшибки = КодОшибки;
	Результат.ТекстОшибки = ТекстОшибки;
	
	Возврат Результат;
	
КонецФункции