
Процедура СделатьХорошо(Парам1, Парам2, Парам3, Парам4 = Неопределено, Парам5 = "", Парам6 = Неопределено)
	Сообщить("Выполнено");
КонецПроцедуры

Функция ПараметрыДеланияХорошо(Парам1)
	
	Результат = Новый Структура;
	Результат.Вставить("Парам1", Парам1);
	Результат.Вставить("Парам2", Ложь);
	Результат.Вставить("Парам3", 0);
	Результат.Вставить("Парам4", Неопределено);
	Результат.Вставить("Парам5", "");
	Результат.Вставить("Парам6", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура СделатьХорошоРеф(ПараметрыДеланияХорошо)
	Сообщить("Выполнено");
КонецПроцедуры

Параметр = Ложь;
СделатьХорошо(1, 2, Параметр);

ПараметрыВыполнения = ПараметрыДеланияХорошо("Очень хорошо");
ПараметрыВыполнения.Парам2 = Истина;
СделатьХорошоРеф(ПараметрыВыполнения);

// В данной транзакции уже происходили ошибки

НачатьТранзакцию(); // Счетчик транзакций - 1, транзакция жива

Попытка
	
	Ссылка = Справочники.Аттракционы.НайтиПоКоду("000000001");
	ПредставлениеСсылки = Строка(Ссылка);
	
	НачатьТранзакцию(); // Счетчик транзакций - 2, транзакция жива
	Попытка	
		СпрОбъект = Ссылка.ПолучитьОбъект();
		СпрОбъект.Записать(); // Счетчик транзакций - 2, транзакция будет отменена
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию(); // Счетчик транзакций - 1, транзакция будет отменена
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = "Ошибка при обработке элемента %1, подробнее: %2";
		ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка,, Ссылка, 
			СтрШаблон(Комментарий, ПредставлениеСсылки, ТекстОшибки));
		ВызватьИсключение;
	КонецПопытки;
	
Исключение
	ОтменитьТранзакцию();
	ВызватьИсключение;
КонецПопытки;