
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	АдресАрхива = ВыгрузитьСервер();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;	
	ПолучитьФайлССервераАсинх(АдресАрхива, "export.zip", ПараметрыДиалога);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьСервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	АдресАрхива = ОбработкаОбъект.ПодготовитьАрхив();
	Возврат АдресАрхива;
КонецФункции

#КонецОбласти
