#Область ПрограммныйИнтерфейс

// Код ошибки: адрес центральной базы не задан.
//
// Возвращаемое значение:
//  Строка - код ошибки
Функция КодОшибки_АдресНеЗадан() Экспорт	
	Возврат "АдресНеЗадан";	
КонецФункции

// Код ошибки: аутентификация не выполнена.
//
// Возвращаемое значение:
//  Строка - код ошибки
Функция КодОшибки_АутентификацияНеВыполнена() Экспорт	
	Возврат "АутентификацияНеВыполнена";	
КонецФункции

// Код ошибки: ошибка разбора ответа.
//
// Возвращаемое значение:
//  Строка - код ошибки
Функция КодОшибки_ОшибкаРазбораОтвета() Экспорт	
	Возврат "ОшибкаРазбораОтвета";	
КонецФункции

// Код ошибки: ошибка соединения.
//
// Возвращаемое значение:
//  Строка - код ошибки
Функция КодОшибки_ОшибкаСоединения() Экспорт	
	Возврат "ОшибкаСоединения";	
КонецФункции

#КонецОбласти