///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает строки вида "день", "дня", "дней".
//
// Параметры:
//   Число                       - Число  - целое число, к которому нужно добавить предмет исчисления.
//   ФорматнаяСтрока             - Строка - см. одноименный параметр метода ЧислоПрописью,
//                                          например: "ДП=Истина".
//   ПараметрыПредметаИсчисления - Строка - см. одноименный параметр метода ЧислоПрописью,
//                                          например: НСтр("ru = 'день,дня,дней,,,,,,0'").
//
//  Возвращаемое значение:
//   Строка
//
Функция ПредметЦелогоЧисла(Число, ФорматнаяСтрока, ПараметрыПредметаИсчисления) Экспорт
	
	ЦелоеЧисло = Цел(Число);
	
	ПрописьЧисла = ЧислоПрописью(ЦелоеЧисло, ФорматнаяСтрока, НСтр("ru = ',,,,,,,,0'"));
	
	ПрописьЧислаИПредмета = ЧислоПрописью(ЦелоеЧисло, ФорматнаяСтрока, ПараметрыПредметаИсчисления);
	
	Возврат СтрЗаменить(ПрописьЧислаИПредмета, ПрописьЧисла, "");
	
КонецФункции

// Возвращает структуру имен видов предупреждений безопасности.
// Каждое свойство содержит имя ключа структуры.
//
// Возвращаемое значение:
//  Структура:
//   * ПослеОбновления - Строка
//   * ПередДобавлениемДополнительногоОтчетаИлиОбработки - Строка
//   * ПередДобавлениемРасширений - Строка
//   * ПередВыборомФайлаОбновления - Строка
//   * ПередВыборомРоли - Строка
//   * ПриИзмененииСпискаЗапрещенныхРасширений - Строка
//   * ПередОткрытиемФайла - Строка
//   * ПередДобавлениемВнешнейКомпоненты - Строка
//   * ПередУдалениемРасширенияБезДанных - Строка
//   * ПередУдалениемРасширенияСДанными - Строка
//   * ПередОтключениемРасширенияСДанными - Строка
//
Функция ВидыПредупрежденийБезопасности() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПослеОбновления");
	Результат.Вставить("ПослеПоявленияПрава");
	Результат.Вставить("ПередДобавлениемДополнительногоОтчетаИлиОбработки");
	Результат.Вставить("ПередВключениемРегламентногоЗаданияДополнительнойОбработки");
	Результат.Вставить("ПередДобавлениемРасширений");
	Результат.Вставить("ПередВыборомФайлаОбновления");
	Результат.Вставить("ПередВыборомРоли");
	Результат.Вставить("ПриИзмененииСпискаЗапрещенныхРасширений");
	Результат.Вставить("ПередОткрытиемФайла");
	Результат.Вставить("ПередДобавлениемВнешнейКомпоненты");
	Результат.Вставить("ПередУдалениемРасширенияБезДанных");
	Результат.Вставить("ПередУдалениемРасширенияСДанными");
	Результат.Вставить("ПередОтключениемРасширенияСДанными");
	
	Для Каждого КлючИЗначение Из Результат Цикл
		Результат[КлючИЗначение.Ключ] = КлючИЗначение.Ключ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вычисляет начальное имя для входа по полному имени пользователя.
Функция ПолучитьКраткоеИмяПользователяИБ(Знач ПолноеИмя) Экспорт
	
	Разделители = Новый Массив;
	Разделители.Добавить(" ");
	Разделители.Добавить(".");
	
	КраткоеИмя = "";
	Для Счетчик = 1 По 3 Цикл
		
		Если Счетчик <> 1 Тогда
			КраткоеИмя = КраткоеИмя + ВРег(Лев(ПолноеИмя, 1));
		КонецЕсли;
		
		ПозицияРазделителя = 0;
		Для каждого Разделитель Из Разделители Цикл
			ПозицияТекущегоРазделителя = СтрНайти(ПолноеИмя, Разделитель);
			Если ПозицияТекущегоРазделителя > 0
			   И (    ПозицияРазделителя = 0
			      ИЛИ ПозицияРазделителя > ПозицияТекущегоРазделителя ) Тогда
				ПозицияРазделителя = ПозицияТекущегоРазделителя;
			КонецЕсли;
		КонецЦикла;
		
		Если ПозицияРазделителя = 0 Тогда
			Если Счетчик = 1 Тогда
				КраткоеИмя = ПолноеИмя;
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
		Если Счетчик = 1 Тогда
			КраткоеИмя = Лев(ПолноеИмя, ПозицияРазделителя - 1);
		КонецЕсли;
		
		ПолноеИмя = Прав(ПолноеИмя, СтрДлина(ПолноеИмя) - ПозицияРазделителя);
		Пока Разделители.Найти(Лев(ПолноеИмя, 1)) <> Неопределено Цикл
			ПолноеИмя = Сред(ПолноеИмя, 2);
		КонецЦикла;
	КонецЦикла;
	
	Возврат КраткоеИмя;
	
КонецФункции

// Для формы элементов справочников Пользователи и ВнешниеПользователи.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//        - РасширениеУправляемойФормыДляОбъектов:
//    * Элементы - ВсеЭлементыФормы:
//        ** ВходВПрограммуРазрешен - ПолеФормы
//                                  - РасширениеПоляФормыДляПоляФлажка
//        ** ИзменитьОграничениеНаВходВПрограмму - ПолеФормы
//                                               - РасширениеПоляФормыДляПоляФлажка
//
Процедура ОбновитьОграничениеСрокаДействия(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Элементы.ИзменитьОграничениеНаВходВПрограмму.Видимость =
		Элементы.СвойстваПользователяИБ.Видимость И Форма.УровеньДоступа.УправлениеСписком;
	
	Если Не Элементы.СвойстваПользователяИБ.Видимость Тогда
		Элементы.ВходВПрограммуРазрешен.Заголовок = "";
		Возврат;
	КонецЕсли;
	
	Элементы.ИзменитьОграничениеНаВходВПрограмму.Доступность = Форма.УровеньДоступа.НастройкиДляВхода;
	
	ЗаголовокСОграничением = "";
	
	Если Форма.СрокДействияНеОграничен Тогда
		ЗаголовокСОграничением = НСтр("ru = 'Вход в приложение разрешен (без ограничения срока)'");
		
	ИначеЕсли ЗначениеЗаполнено(Форма.СрокДействия) Тогда
		ЗаголовокСОграничением = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Вход в приложение разрешен (до %1)'"),
			Формат(Форма.СрокДействия, "ДЛФ=D"));
			
	ИначеЕсли ЗначениеЗаполнено(Форма.ПросрочкаРаботыВПрограммеДоЗапрещенияВхода) Тогда
		ЗаголовокСОграничением = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Вход в приложение разрешен (запретить, если не работает более %1)'"),
			Формат(Форма.ПросрочкаРаботыВПрограммеДоЗапрещенияВхода, "ЧГ=") + " "
				+ ПредметЦелогоЧисла(Форма.ПросрочкаРаботыВПрограммеДоЗапрещенияВхода,
					"", НСтр("ru = 'день,дня,дней,,,,,,0'")));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаголовокСОграничением) Тогда
		Элементы.ВходВПрограммуРазрешен.Заголовок = ЗаголовокСОграничением;
		Элементы.ИзменитьОграничениеНаВходВПрограмму.Заголовок = НСтр("ru = 'Изменить ограничение'");
	Иначе
		Элементы.ВходВПрограммуРазрешен.Заголовок = "";
		Элементы.ИзменитьОграничениеНаВходВПрограмму.Заголовок = НСтр("ru = 'Установить ограничение'");
	КонецЕсли;
	
КонецПроцедуры

// Для формы элементов справочников Пользователи и ВнешниеПользователи.
//
// Параметры:
//  Форма - см. Справочник.Пользователи.Форма.ФормаЭлемента
//        - см. Справочник.ВнешниеПользователи.Форма.ФормаЭлемента
//  ПарольУстановлен - Булево
//  АвторизованныйПользователь - СправочникСсылка.Пользователи
//                             - СправочникСсылка.ВнешниеПользователи
//
Процедура УстановитьНаличиеПароля(Форма, ПарольУстановлен, АвторизованныйПользователь) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если ПарольУстановлен Тогда
		Элементы.НадписьНаличиеПароля.Заголовок = НСтр("ru = 'Пароль установлен'");
		Элементы.ПотребоватьСменуПароляПриВходе.Заголовок =
			НСтр("ru = 'Потребовать смену пароля при входе'");
	Иначе
		Элементы.НадписьНаличиеПароля.Заголовок = НСтр("ru = 'Пустой пароль'");
		Элементы.ПотребоватьСменуПароляПриВходе.Заголовок =
			НСтр("ru = 'Потребовать установку пароля при входе'");
	КонецЕсли;
	
	Если ПарольУстановлен
	   И Форма.Объект.Ссылка = АвторизованныйПользователь Тогда
		
		Элементы.СменитьПароль.Заголовок = НСтр("ru = 'Сменить пароль'");
	Иначе
		Элементы.СменитьПароль.Заголовок = НСтр("ru = 'Установить пароль'");
	КонецЕсли;
	
КонецПроцедуры

// Для формы списка справочников Пользователи и ВнешниеПользователи.
//
// Параметры:
//  Список - ДинамическийСписок
//  ИмяПараметра - Строка
//  ЗначениеПараметра - Произвольный
//
Процедура ОбновитьЗначениеПараметраКомпоновкиДанных(Список, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	Для Каждого Параметр Из Список.Параметры.Элементы Цикл
		Если Строка(Параметр.Параметр) = ИмяПараметра Тогда
			Если ЗначениеПараметра = Null Тогда
				Если Параметр.Использование Тогда
					Параметр.Использование = Ложь;
				КонецЕсли;
				Возврат;
			ИначеЕсли Параметр.Использование
			        И Параметр.Значение = ЗначениеПараметра Тогда
				Возврат;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Список.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
	
КонецПроцедуры

// Только для внутреннего использования.
Функция ТекущийПользователь(АвторизованныйПользователь) Экспорт
	
	Если ТипЗнч(АвторизованныйПользователь) <> Тип("СправочникСсылка.Пользователи") Тогда
		ТекстОшибки = НСтр("ru = 'Невозможно получить текущего пользователя
									|в сеансе внешнего пользователя.'");
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	Возврат АвторизованныйПользователь;
	
КонецФункции

// Только для внутреннего использования.
Функция ТекущийВнешнийПользователь(АвторизованныйПользователь) Экспорт
	
	Если ТипЗнч(АвторизованныйПользователь) <> Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		ТекстОшибки = НСтр("ru = 'Невозможно получить текущего внешнего пользователя
									|в сеансе пользователя.'");
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	Возврат АвторизованныйПользователь;
	
КонецФункции

#Область ПроцедурыИФункцияДляРаботыФормСправочников

// Для формы списка справочников Пользователи и ВнешниеПользователи.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура СкрытьКомандыПриВыбореПодборе(Форма) Экспорт
	
	ИменаКнопокДляВыбораПодбора = СтрРазделить(ИменаКнопокДляВыбораПодбора(), Символы.ПС);
	ТипКнопкаФормы = Тип("КнопкаФормы");
	
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = ТипКнопкаФормы
		   И ЭлементФормы.Видимость
		   И ИменаКнопокДляВыбораПодбора.Найти(ЭлементФормы.Имя) = Неопределено Тогда
			ЭлементФормы.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Для процедуры СкрытьКомандыПриВыбореПодборе.
Функция ИменаКнопокДляВыбораПодбора()
	
	Возврат
	"ГруппыКонтекстноеМенюВыбрать
	|ГруппыКонтекстноеМенюПоискПоТекущемуЗначению
	|ГруппыКонтекстноеМенюНайтиВезде
	|ГруппыКонтекстноеМенюОтменитьПоиск
	|ГруппыКонтекстноеМенюВыделитьВсе
	|ГруппыВыбрать
	|ГруппыИерархическийСписок
	|ГруппыСписок
	|ГруппыДерево
	|ГруппыНастройкаСписка
	|ГруппыЗагрузитьНастройкиДинамическогоСписка
	|ГруппыСохранитьНастройкиДинамическогоСписка
	|ГруппыСтандартныеНастройкиДинамическогоСписка
	|ГруппыОчиститьОформлениеОтметокТаблицы
	|ГруппыОбновить
	|ГруппыВыделитьВсе
	|ГруппыВыбратьТакси
	|ГруппыВключитьВВыбранные
	|ГруппыИсключитьИзВыбранных
	|ГруппыПоискПоТекущемуЗначению
	|ГруппыНайтиВезде
	|ГруппыНайти
	|ГруппыИсторияПоиска
	|ГруппыОтменитьПоиск
	|СписокКонтекстноеМенюВыбрать
	|СписокКонтекстноеМенюНайтиВезде
	|СписокКонтекстноеМенюОтменитьПоиск
	|СписокКонтекстноеМенюВыделитьВсе
	|СписокВыбрать
	|СписокНастройкаСписка
	|СписокЗагрузитьНастройкиДинамическогоСписка
	|СписокСохранитьНастройкиДинамическогоСписка
	|СписокСтандартныеНастройкиДинамическогоСписка
	|СписокОчиститьОформлениеОтметокТаблицы
	|СписокОбновить
	|СписокВыделитьВсе
	|СписокВыбратьТакси
	|СписокВключитьВВыбранные
	|СписокИсключитьИзВыбранных
	|СписокПоказатьПользователейНижестоящихГрупп
	|СписокПоказатьНедействительныхПользователей
	|СписокПоискПоТекущемуЗначению
	|СписокНайтиВезде
	|СписокНайти
	|СписокИсторияПоиска
	|СписокОтменитьПоиск
	|СписокТекущиеДанныеКонтактнаяИнформацияКонтекстноеМенюПоказать
	|ФормаВыбрать
	|ФормаНастройкаСписка
	|ФормаЗагрузитьНастройкиДинамическогоСписка
	|ФормаСохранитьНастройкиДинамическогоСписка
	|ФормаСтандартныеНастройкиДинамическогоСписка
	|ФормаОбновить
	|ФормаПоискПоТекущемуЗначению
	|ФормаНайти
	|ФормаОтменитьПоиск
	|ФормаВыбратьИЗакрыть
	|ФормаВыбратьВыделенные
	|ФормаИзменитьФорму
	|ФормаСправка";
	
КонецФункции

#КонецОбласти

#КонецОбласти
