#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьИзмененияНаУзлахОбмена();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Регистрирует изменение документа на узлах плана обмена ОбменРемонтАттракционов,
// закрепленных за исполнителем документа.
//
Процедура ЗарегистрироватьИзмененияНаУзлахОбмена()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УзлыОбмена.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменРемонтАттракционов КАК УзлыОбмена
		|ГДЕ
		|	УзлыОбмена.Пользователь = &Исполнитель
		|	И НЕ УзлыОбмена.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
