
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СохраненныйКлючПодписи = ТокеныДоступа.СохраненныйКлючПодписи(Объект.Ссылка);
	
	КлючПодписиИзменен = Ложь;
	
	Если ЗначениеЗаполнено(СохраненныйКлючПодписи) Тогда
		КлючПодписи = Новый УникальныйИдентификатор;
	Иначе
		КлючПодписи = "";
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если КлючПодписиИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ТекущийОбъект.Ссылка, КлючПодписи, "КлючПодписи");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлючПодписиПриИзменении(Элемент)
	КлючПодписиИзменен = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьТокенТекущегоПользователя(Команда)
	Токен = СформироватьТокенДоступа();
	Если ЗначениеЗаполнено(Токен) Тогда
		ВвестиСтрокуАсинх(Токен, "Сформированный токен");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьТокенДоступа()
	
	КлючПодписиДляФормированияТокена = Неопределено;
	Если КлючПодписиИзменен Тогда
		КлючПодписиДляФормированияТокена = КлючПодписи;
	Иначе
		КлючПодписиДляФормированияТокена = ТокеныДоступа.СохраненныйКлючПодписи(Объект.Ссылка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КлючПодписиДляФормированияТокена) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для формирования токена необходимо установить ключ подписи");
		Возврат "";
	КонецЕсли;
		
	ПараметрыФормированияТокена = ТокеныДоступа.НовыеПараметрыФормированияТокена();
	ПараметрыФормированияТокена.Эмитент = Объект.ИмяЭмитента;
	ПараметрыФормированияТокена.КлючПодписи = КлючПодписиДляФормированияТокена;
	
	Для Каждого Строка Из Объект.Получатели Цикл
		ПараметрыФормированияТокена.Получатели.Добавить(Строка.ИмяПолучателя);
	КонецЦикла;
	
	Возврат ТокеныДоступа.СформироватьТокенДоступа(ПараметрыФормированияТокена);	
	
КонецФункции

#КонецОбласти

