
// Выполнить обмен.
// 
// Параметры:
//  ПараметрыОбмена - См. НовыеПараметрыОбмена()
Процедура ВыполнитьОбмен(Знач ПараметрыОбмена = Неопределено) Экспорт
	
	Если ПараметрыОбмена = Неопределено Тогда
		ПараметрыОбмена = НовыеПараметрыОбмена();
	КонецЕсли;
	
	Результат = ОбменВызовСервера.ВыполнитьОбмен(ПараметрыОбмена);
	
	Если Результат.Успешно Тогда
		ПредупреждениеАсинх(Результат.Результат);
	Иначе
		Если Результат.КодОшибки = ОбменКлиентСервер.КодОшибки_АутентификацияНеВыполнена() Тогда
			ПредупреждениеАсинх("Необходим ввод логина и пароля");
		Иначе
			ПредупреждениеАсинх(Результат.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Параметры обмена.
// 
// Возвращаемое значение:
//  Структура - Параметры обмена:
// * Логин - Строка - Логин для подключения к центральной базе
// * Пароль - Строка - Пароль для подключения к центральной базе
// * ОповещениеОЗавершении - ОписаниеОповещения, Неопределено
Функция НовыеПараметрыОбмена() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Логин", "");
	Результат.Вставить("Пароль", "");
	Результат.Вставить("ОповещениеОЗавершении");
	
	Возврат Результат;
	
КонецФункции