
#Область ПрограммныйИнтерфейс

// Выполнить обмен.
// 
// Параметры:
//  ПараметрыОбмена - См. НовыеПараметрыОбмена()
Процедура ВыполнитьОбмен(Знач ПараметрыОбмена = Неопределено) Экспорт
	
	Если ПараметрыОбмена = Неопределено Тогда
		ПараметрыОбмена = НовыеПараметрыОбмена();
	КонецЕсли;
	
	Состояние("Выполнение обмена", 30);
	
	Результат = ОбменВызовСервера.ВыполнитьОбмен(ПараметрыОбмена);
	
	Если Результат.Успешно Тогда
		Состояние("Выполнение обмена", 100);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Результат.Результат;
		Сообщение.Сообщить();
	Иначе
		Если Результат.КодОшибки = ОбменКлиентСервер.КодОшибки_АутентификацияНеВыполнена() Тогда
			ОткрытьФорму("ОбщаяФорма.НачалоРаботы");
		Иначе
			ПредупреждениеАсинх(Результат.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Параметры обмена.
// 
// Возвращаемое значение:
//  Структура - Параметры обмена:
// * Логин - Строка - Логин для подключения к центральной базе
// * Пароль - Строка - Пароль для подключения к центральной базе
// * ОповещениеОЗавершении - ОписаниеОповещения, Неопределено - Оповещение о завершении обмена
Функция НовыеПараметрыОбмена() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Логин", "");
	Результат.Вставить("Пароль", "");
	Результат.Вставить("ОповещениеОЗавершении", Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти