
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	АдресРезультата = ВыгрузитьСервер();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;	
	ПолучитьФайлССервераАсинх(АдресРезультата, "export.zip", ПараметрыДиалога);
	
//	ДлительнаяОперация = НачатьВыгрузкуНаСервере(УникальныйИдентификатор);
//	
//	Оповещение = Новый ОписаниеОповещения("ВыгрузкаЗавершение", ЭтотОбъект);
//	
//	ОповещениеОПрогрессе = Новый ОписаниеОповещения("ВыгрузкаОповещениеОПрогрессе", ЭтотОбъект);
//	
//	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
//	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
//	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;
//	
//	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
//	
//	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжиданиеВыгрузки;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ПоместитьВоВременноеХранилище(ОбработкаОбъект.ПодготовитьАрхив());
	
КонецФункции

//&НаКлиенте
//Процедура ВыгрузкаОповещениеОПрогрессе(Результат, ДополнительныеПараметры) Экспорт	
//    
//	ПроцентВыполненияДлительнойОперации = Результат.Прогресс.Процент;
//	ПрогрессДлительнойОперации = Результат.Прогресс.Текст;
//		
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ВыгрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт	
//    
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если Результат.Статус = "Ошибка" Тогда
//		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
//		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаНачалоВыгрузки;
//		Возврат;
//	КонецЕсли;
//
//	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаЗавершениеВыгрузки;
//		
//	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;	
//	ПолучитьФайлССервераАсинх(Результат.АдресРезультата, "export.zip", ПараметрыДиалога);
//		
//КонецПроцедуры
//
//&НаСервереБезКонтекста
//Функция НачатьВыгрузкуНаСервере(УникальныйИдентификатор)
//	
//	ИмяМетода = "Обработки.ВыгрузкаНаСайт.ПодготовитьАрхив";
//	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
//	
//	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода);
//	
//КонецФункции

#КонецОбласти
