
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ДополнительнаяОбработкаСсылка) Тогда
		Элементы.РежимОтладки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	АдресРезультата = ВыгрузитьСервер();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;	
	ПолучитьФайлССервераАсинх(АдресРезультата, "export.zip", ПараметрыДиалога);
		
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(Параметры.ДополнительнаяОбработкаСсылка) Тогда
		ПараметрыФормы.Вставить("ДополнительнаяОбработкаСсылка", Параметры.ДополнительнаяОбработкаСсылка);
	Иначе
		Если Не ЗначениеЗаполнено(ДополнительнаяОбработкаСсылка) Тогда
			ПредупреждениеАсинх(НСтр("ru = 'Необходимо выбрать обработку для сохранения настроек'"));
			Возврат;
		КонецЕсли;
		ПараметрыФормы.Вставить("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка);
	КонецЕсли;
	
	ОткрытьФорму("ВнешняяОбработка.ВыгрузкаНаСайт.Форма.НастройкаВыгрузки", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ПоместитьВоВременноеХранилище(ОбработкаОбъект.ПодготовитьАрхив());
	
КонецФункции

#КонецОбласти
