
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура РаспаковатьНаКлиенте(Команда)
	
	#Если ВебКлиент Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Недоступно в веб-клиенте";
		СообщениеПользователю.Сообщить();
	#Иначе
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите архив";
	РезультатВыбораАрхива = Ждать Диалог.ВыбратьАсинх();
	
	Если РезультатВыбораАрхива = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Куда распаковать";
	РезультатВыбораПути = Ждать Диалог.ВыбратьАсинх();
	
	Если РезультатВыбораПути = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Чтение = Новый ЧтениеФайлаАрхива(РезультатВыбораАрхива[0]);
	Чтение.ИзвлечьВсе(РезультатВыбораПути[0]);
	Чтение.Закрыть();
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СохранитьАрхив(Команда)
	
	Адрес = СохранитьАрхивНаСервере();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	
	ПолучитьФайлССервераАсинх(Адрес, "ОтчетОбОшибке.zip", ПараметрыДиалога);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СохранитьАрхивНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОбОшибке.Архив КАК Архив
		|ИЗ
		|	Документ.ОтчетОбОшибке КАК ОтчетОбОшибке
		|ГДЕ
		|	ОтчетОбОшибке.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеАрхива = Выборка.Архив.Получить();
		Возврат ПоместитьВоВременноеХранилище(ДанныеАрхива);
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

#КонецОбласти
