
&НаКлиенте
Асинх Процедура РаспаковатьНаКлиенте(Команда)
	
	#Если ВебКлиент Тогда
		Сообщить("Недоступно в веб-клиенте");
	#Иначе
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите архив";
	РезультатВыбораАрхива = Ждать Диалог.ВыбратьАсинх();
	
	Если РезультатВыбораАрхива = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Куда распаковать";
	РезультатВыбораПути = Ждать Диалог.ВыбратьАсинх();
	
	Если РезультатВыбораПути = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Чтение = Новый ЧтениеФайлаАрхива(РезультатВыбораАрхива[0]);
	Чтение.ИзвлечьВсе(РезультатВыбораПути[0]);
	Чтение.Закрыть();
	
	#КонецЕсли

КонецПроцедуры

&НаСервере
Функция СохранитьАрхивНаСервере()
	
	ДанныеАрхива = Объект.Ссылка.Архив.Получить();
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеАрхива);

КонецФункции

&НаКлиенте
Процедура СохранитьАрхив(Команда)
	
	Адрес = СохранитьАрхивНаСервере();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	
	ПолучитьФайлССервераАсинх(Адрес, "ОтчетОбОшибке.zip", ПараметрыДиалога)
	
КонецПроцедуры
