
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Константы.АдресЦентральнойБазы.Получить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	АдресПриИзмененииНаСервере(Адрес);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьДоступность(Команда)
	ПроверитьДоступностьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьКоличествоЗаказов(Команда)
	ПолучитьКоличествоЗаказовНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура АдресПриИзмененииНаСервере(Адрес)
	Константы.АдресЦентральнойБазы.Установить(Адрес);
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступностьНаСервере()
	
	СтруктураURI = ОбщегоНазначенияСервер.СтруктураURI(Адрес);
	
	СтруктураURI.Логин = Логин;
	СтруктураURI.Пароль = Пароль;
	
	ПутьЗапроса = СтруктураURI.ПутьНаСервере + "/hs/mob-repair/ping";
	Если Лев(ПутьЗапроса, 1) <> "/" Тогда
		ПутьЗапроса = "/" + ПутьЗапроса;
	КонецЕсли;
	
	Попытка
		
		Соединение = ОбщегоНазначенияСервер.СоединениеHTTP(СтруктураURI);
		
		// Создание HTTP запроса с учетом относительного пути
		ЗапросHTTP = Новый HTTPЗапрос(ПутьЗапроса);
		
		// Выполнение GET запроса
		ОтветHTTP = Соединение.Получить(ЗапросHTTP);
		
		// Проверка кода состояния
		Если ОтветHTTP.КодСостояния = 200 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Соединение установлено успешно";
			Сообщение.Сообщить();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка соединения. Код состояния: " + ОтветHTTP.КодСостояния;
			Сообщение.Сообщить();
		КонецЕсли;
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при проверке доступности: " 
			+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьКоличествоЗаказовНаСервере()
	
	СтруктураURI = ОбщегоНазначенияСервер.СтруктураURI(Адрес);
	
	СтруктураURI.Логин = Логин;
	СтруктураURI.Пароль = Пароль;
	
	ПутьЗапроса = СтруктураURI.ПутьНаСервере + "/hs/mob-repair/order-outfits";
	Если Лев(ПутьЗапроса, 1) <> "/" Тогда
		ПутьЗапроса = "/" + ПутьЗапроса;
	КонецЕсли;
	
	Попытка
		
		Соединение = ОбщегоНазначенияСервер.СоединениеHTTP(СтруктураURI);
		
		ЗапросHTTP = Новый HTTPЗапрос(ПутьЗапроса);
		
		ОтветHTTP = Соединение.Получить(ЗапросHTTP);
		
		Если ОтветHTTP.КодСостояния = 200 Тогда
			Попытка
				РезультатJSON = ПрочитатьЗначениеJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
				КоличествоЗаказов = РезультатJSON.Количество;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Количество заказов: " + КоличествоЗаказов;
				Сообщение.Сообщить();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при чтении ответа в формате JSON: " 
					+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				Сообщение.Сообщить();
			КонецПопытки;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка получения количества заказов. Код состояния: " + ОтветHTTP.КодСостояния;
			Сообщение.Сообщить();
		КонецЕсли;
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении количества заказов: " 
			+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры
#КонецОбласти

