
&НаСервере
Процедура ПроверитьДоступностьНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступность(Команда)
	ПроверитьДоступностьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АдресПриИзмененииНаСервере(Адрес)
	Константы.АдресЦентральнойБазы.Установить(Адрес);
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	АдресПриИзмененииНаСервере(Адрес);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Константы.АдресЦентральнойБазы.Получить();

КонецПроцедуры


